src/Catalogs/asur_КатегорииЗадач/asur_КатегорииЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>asur_КатегорииЗадач</name>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.asur_СписокЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросСбораДанныхДляКода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураХранениеФайлов</name>
    <attributes>
      <name>ЕстьПрефикс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзПрефикса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СимволРазделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРеквизитаОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/asur_ПрефиксыОбъектов/asur_ПрефиксыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>asur_ПрефиксыОбъектов</name>
  <resources>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.asur_КонфигурацииОрганизации</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.asur_ОтделыПодразделений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/asur_КатегорииЗадач/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//	ДатаНачалаВеденияИстории = ТекущаяДатаСеанса();
	//	Автор = Пользователи.ТекущийПользователь();
	
	Если Параметры.Свойство("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Параметры.ОбъектМетаданных;
		//ОбъектМетаданных = ТипОбъектаМетаданных.ЗначениеПустойСсылки;
	КонецЕсли; 
	
	ТипыДляПрефикса = Метаданные.РегистрыСведений.asur_ПрефиксыОбъектов.Измерения.Объект.Тип;
	
	ЗаполнитьСписокиРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура СформироватьЗапросДляКода(Команда)
	ЗаполнитьЗапросИСтрокуДляКода();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапросИСтрокуДляКода()
	Объект.ЗапросСбораДанныхДляКода = "";
	Объект.ЗапросСбораДанныхДляКода = СформироватьТекстЗапроса(Объект.СтруктураХранениеФайлов,"ЗначениеИзПрефикса")
	+
		 "
		|	;

		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	asur_КатегорииЗадачСтруктураХранениеФайлов.НомерСтроки КАК НомерСтроки,
		|	asur_КатегорииЗадачСтруктураХранениеФайлов.ИмяРеквизитаОбъекта КАК ИмяРеквизитаОбъекта,
		|	asur_КатегорииЗадачСтруктураХранениеФайлов.СинонимРеквизитаОбъекта КАК СинонимРеквизитаОбъекта,
		|	asur_КатегорииЗадачСтруктураХранениеФайлов.ЕстьПрефикс КАК ЕстьПрефикс,
		|	asur_КатегорииЗадачСтруктураХранениеФайлов.ЗначениеИзПрефикса КАК ЗначениеИзПрефикса,
		|	asur_КатегорииЗадачСтруктураХранениеФайлов.ПутьКДанным КАК ПутьКДанным,
		|	asur_КатегорииЗадачСтруктураХранениеФайлов.СимволРазделения КАК СимволРазделения
		|ИЗ
		|	ВТ_СписокЗадач КАК ВТ_СписокЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.asur_КатегорииЗадач.СтруктураХранениеФайлов КАК asur_КатегорииЗадачСтруктураХранениеФайлов
		|		ПО ВТ_СписокЗадач.КатегоряЗадачи = asur_КатегорииЗадачСтруктураХранениеФайлов.Ссылка

		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки ";
	
	Если Объект.ЗапросСбораДанныхДляКода = "" Тогда
		Возврат;
	КонецЕсли; 
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	ЗАпрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = Объект.ЗапросСбораДанныхДляКода;
		//"ВЫБРАТЬ
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.Ссылка КАК Ссылка,
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.НомерСтроки КАК НомерСтроки,
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.ЕстьПрефикс КАК ЕстьПрефикс,
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.ЗначениеИзПрефикса КАК ЗначениеИзПрефикса,
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.ИмяРеквизитаОбъекта КАК ИмяРеквизитаОбъекта,
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.ПутьКДанным КАК ПутьКДанным,
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.СимволРазделения КАК СимволРазделения,
		//|	asur_КатегорииЗадачСтруктураХранениеФайлов.СинонимРеквизитаОбъекта КАК СинонимРеквизитаОбъекта
		//|ИЗ
		//|	Справочник.asur_КатегорииЗадач.СтруктураХранениеФайлов КАК asur_КатегорииЗадачСтруктураХранениеФайлов";
		
	Запрос.УстановитьПараметр("Ссылка", ОбъектМетаданных);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВДЗ = МВТ.Таблицы.Найти("ВТ_СписокЗадач").ПолучитьДанные().Выбрать();
	//Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
	КонецЦикла;
	МВТ.Закрыть();
	
КонецПроцедуры
 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьСписокиРеквизитов()
//	ЗаполнитьСписокВыбранныхРеквизитов();
	ЗаполнитьСписокДоступныхРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхРеквизитов()
	
	СписокРеквизитов.Очистить();
	
	//Стандартные Реквизиты
	Для каждого Реквизит Из Объект.ОбъектМетаданных.Метаданные().СтандартныеРеквизиты Цикл
		ИмяРеквизита = Реквизит.Имя;
		
		//Выводить Справочника: наименование , код 
		//Выводить Документа: Дата , Номер 
		//Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ОбъектМетаданных)) Тогда
		Если Метаданные.Справочники.Содержит(Объект.ОбъектМетаданных.Метаданные()) Тогда
			Если ИмяРеквизита = "Код" ИЛИ ИмяРеквизита = "Наименование"  Тогда
				ДобавитьСтрокуСпискаРеквизитов(Реквизит);
			КонецЕсли
		//ИначеЕсли  Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ОбъектМетаданных))  Тогда
		ИначеЕсли  Метаданные.Документы.Содержит(Объект.ОбъектМетаданных.Метаданные())  Тогда
			Если ИмяРеквизита = "Дата" ИЛИ ИмяРеквизита = "Номер"  Тогда
				ДобавитьСтрокуСпискаРеквизитов(Реквизит);
			КонецЕсли
		КонецЕсли; 
		
	КонецЦикла; 
	
	//Добавленные реквизиты
	Для каждого Реквизит Из Объект.ОбъектМетаданных.Метаданные().Реквизиты Цикл
		ДобавитьСтрокуСпискаРеквизитов(Реквизит);
	КонецЦикла; 
	
	ЗаполнитьЗначенияСпискаРеквизитов(СписокРеквизитов);
	
	СписокРеквизитов.Сортировать("ИмяРеквизитаОбъекта");
	
	СобратьСтрокуКода()

КонецПроцедуры

&НаСервере
Функция СформироватьТекстЗапроса(Знач ТаблицаФормы, ИмяРеквизитаПрефикса)
	
	ТекстЗапросаПрефикса = "";
	ТекстЗапросаСоединенияПрефикса = "";
	ТекстЗапроса =
		"ВЫБРАТЬ 
		| ТекОбъект.КатегоряЗадачи КАК КатегоряЗадачи, " + Символы.ПС;
	//КолСтрок = СписокРеквизитов.Количество(); 
	
	Для каждого Стр  Из ТаблицаФормы Цикл
		Если Стр.ИмяРеквизитаОбъекта = "КатегоряЗадачи" Тогда
		 	Продолжить;
		КонецЕсли; 
		
		ТекстЗапроса = ТекстЗапроса +
		" ТекОбъект." + Стр.ИмяРеквизитаОбъекта + " КАК " + Стр.ИмяРеквизитаОбъекта + "," + Символы.ПС;
		
		Если Стр[ИмяРеквизитаПрефикса] Тогда
			ИмяПоля = Стр.ИмяРеквизитаОбъекта + "_Префикс";
			ТекстЗапросаПрефикса = ТекстЗапросаПрефикса + 
		"	ЕСТЬNULL(" + ИмяПоля + ".Префикс, """") КАК " + ИмяПоля + "," + Символы.ПС;

			ТекстЗапросаСоединенияПрефикса = ТекстЗапросаСоединенияПрефикса + Символы.ПС +
		"		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.asur_ПрефиксыОбъектов КАК "+ ИмяПоля + " 
			|  	ПО ТекОбъект." + Стр.ИмяРеквизитаОбъекта + " = " + ИмяПоля + ".Объект" + Символы.ПС;

		КонецЕсли; 
		
	КонецЦикла; 
	
	ТекстЗапроса =  ТекстЗапроса + ТекстЗапросаПрефикса;
	
	//Убираю последнюю запятую	
	ТекстЗапроса =  Сред(ТекстЗапроса,1,СтрДлина(ТекстЗапроса)-2) + Символы.ПС;
	
	//Помещаю во Временную Талицу ВТ_СписокЗадач
	ТекстЗапроса = ТекстЗапроса +  " ПОМЕСТИТЬ  ВТ_СписокЗадач" + Символы.ПС; 
	
	ТекстЗапроса = ТекстЗапроса + 
		"ИЗ
		|	Справочник.asur_СписокЗадач КАК ТекОбъект " + Символы.ПС 
		+  ТекстЗапросаСоединенияПрефикса + Символы.ПС +  
		"ГДЕ
		|	ТекОбъект.Ссылка = &Ссылка";
	Возврат ТекстЗапроса;
	
КонецФункции
	
	
&НаСервере
Процедура ЗаполнитьЗначенияСпискаРеквизитов(ТаблицаФормы)
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	ЗАпрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = СформироватьТекстЗапроса(ТаблицаФормы, "ЕстьПрефикс");
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектМетаданных);
	Запрос.Выполнить();
	
	
	ВДЗ = МВТ.Таблицы.Найти("ВТ_СписокЗадач").ПолучитьДанные().Выбрать();
	
	Если ВДЗ.Следующий() Тогда
		Для каждого Стр Из ТаблицаФормы Цикл
			Стр.Значение = ВДЗ[Стр.ИмяРеквизитаОбъекта];
			Если Стр.ЕстьПрефикс Тогда
				Стр.ЗначениеПрефикса = ВДЗ[Стр.ИмяРеквизитаОбъекта + "_Префикс"];
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	МВТ.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуСпискаРеквизитов(Реквизит)
	ИмяРеквизита = Реквизит.Имя;
	
	//не выводить реквизиты которые будут удалять
	Если СтрНайти(ИмяРеквизита,"Удалить") Тогда
		Возврат;
		//Не выводить уже выбранные реквизиты
//	ИначеЕсли 	ВыбранныеРеквизиты.НайтиСтроки(Новый Структура("ИмяРеквизитаОбъекта", ИмяРеквизита)).Количество() > 0 Тогда 
//		Возврат;
	КонецЕсли;
	
	Строка = СписокРеквизитов.Добавить();
	Строка.ИмяРеквизитаОбъекта     = ИмяРеквизита;
	Строка.СинонимРеквизитаОбъекта = Реквизит.Синоним;
	Строка.ЕстьПрефикс = ТипыДляПрефикса.СодержитТип(ТипЗнч(ОбъектМетаданных[ИмяРеквизита]));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элемент.ТекущиеДанные;
	СтрПоиска = Новый Структура("ИмяРеквизитаОбъекта", ТекДанные.ИмяРеквизитаОбъекта);
	
	Если НЕ Объект.СтруктураХранениеФайлов.НайтиСтроки(СтрПоиска).Количество() > 0 Тогда
		НовСтр = Объект.СтруктураХранениеФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекДанные);
		Возврат;
	КонецЕсли; 
	
	СобратьСтрокуКода();

КонецПроцедуры

&НаСервере
Процедура СобратьСтрокуКода()
	СтрокаДляКода = "";
	Для каждого Стр Из  Объект.СтруктураХранениеФайлов Цикл
		СтрокаДляКода = СтрокаДляКода + Стр.Значение; 	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураХранениеФайловПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СтруктураХранениеФайлов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЕстьПрефикс Тогда
		Элементы.СтруктураХранениеФайловЗначениеИзПрефикса.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.СтруктураХранениеФайловЗначениеИзПрефикса.ТолькоПросмотр = Истина;			
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти
